import json

class Book:
    def __init__(self, title, author, year, pages):
        self.title = title
        self.author = author
        self.year = year
        self.pages = pages

    def info(self):
        return f'"{self.title}"\n{self.author}\n{self.year} год\n{self.pages} страниц'

    def is_long(self):
        return self.pages > 300

    def to_dict(self):
        return {
            "title": self.title,
            "author": self.author,
            "year": self.year,
            "pages": self.pages
        }

books = [
    Book("Война и мир", "Лев Толстой", 1869, 1225),
    Book("Преступление и наказание", "Фёдор Достоевский", 1866, 671),
    Book("Анна Каренина", "Лев Толстой", 1877, 864),
    Book("Братья Карамазовы", "Фёдор Достоевский", 1880, 824),
    Book("Гордость и предубеждение", "Джейн Остин", 1813, 432),
    Book("Великий Гэтсби", "Ф. Скотт Фицджеральд", 1925, 180),
    Book("Убить пересмешника", "Харпер Ли", 1960, 336),
    Book("Сто лет одиночества", "Габриэль Гарсиа Маркес", 1967, 448),
    Book("Тихий Дон", "Михаил Шолохов", 1940, 1360),
    Book("Доктор Живаго", "Борис Пастернак", 1957, 592),
    Book("Идиот", "Фёдор Достоевский", 1869, 672),
    Book("Евгений Онегин", "Александр Пушкин", 1833, 224),
    Book("Мёртвые души", "Николай Гоголь", 1842, 352),
    Book("Гарри Поттер и философский камень", "Дж. К. Роулинг", 1997, 332),
    Book("Властелин колец: Братство кольца", "Дж. Р. Р. Толкин", 1954, 423),
    Book("Игра престолов", "Джордж Р. Р. Мартин", 1996, 694),
    Book("Над пропастью во ржи", "Дж. Д. Сэлинджер", 1951, 224),
    Book("О дивный новый мир", "Олдос Хаксли", 1932, 288),
    Book("Фауст", "Иоганн Вольфганг фон Гёте", 1832, 320),
    Book("Три товарища", "Эрих Мария Ремарк", 1936, 480),
]

for book in books:
    print(book.info())
    if book.is_long():
        print('Книга длинная')
    else:
        print('Книга короткая')
    print()

books_dicts = [book.to_dict() for book in books]
